app/controllers/reservations_controller.rb

INSERT INTO "guests" ("email", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "sobi@gmail.com"], ["name", "sobin"], ["created_at", "2018-01-27 02:47:26.749520"], ["updated_at", "2018-01-27 02:47:26.749520"]]
INSERT INTO "reservations" ("guest_id", "table_id", "guest_party_size", "requested_date_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    # params refactoring
    set_resturant
    raise ExceptionHandler::OutofShiftTimeExceptionTime unless include_between_shift_time? && should_be_future_time
    reservation = ReservationService.create_reservation(
                                                          guest_email: reservation_create_params[:guest_email],
                                                          guest_name: reservation_create_params[:guest_name],
                                                          guest_party_size: reservation_create_params[:guest_party_size],
                                                          requested_date_time: reservation_create_params[:requested_date_time],
                                                          restaurant: @current_restaurant
                                                       )

UPDATE "reservations" SET "guest_party_size" = ?, "requested_date_time" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["guest_party_size", 4], ["requested_date_time", "2018-01-28 20:00:00"], ["updated_at", "2018-01-26 07:01:02.141357"], ["id", 1]]
---
  def update
    set_reservation
    raise ExceptionHandler::OutofShiftTimeExceptionTime unless include_between_shift_time? && should_be_future_time
    ReservationService.update_reservation(reservation: @reservation, update_reservation_params: reservation_update_params)

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_reservation
    @reservation ||= Reservation.find(params[:id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."email" = ? LIMIT ?  [["email", "sobisunny@gmail.com"], ["LIMIT", 1]]
---
  def set_resturant
    @current_restaurant ||= Restaurant.find_by(email: params[:restaurant_email])