app/controllers/restaurants_controller.rb

  def index
    restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def create
    restaurant = Restaurant.new(restaurant_params)
    if restaurant.save
---
INSERT INTO "restaurants" ("name", "email", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "new star"], ["email", "sobi@gmail.com"], ["phone_number", "8867231414"], ["created_at", "2018-01-27 02:45:41.170509"], ["updated_at", "2018-01-27 02:45:41.170509"]]