app/controllers/tables_controller.rb

  def index
    tables = Table.where(restaurant: @current_restaurant)
---
SELECT "tables".* FROM "tables" WHERE "tables"."restaurant_id" = ?  [["restaurant_id", 1]]

  def create
    table = Table.new(table_params.merge(restaurant: @current_restaurant))
    table.save
---
INSERT INTO "tables" ("number", "number_of_seats", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["number", 6], ["number_of_seats", 6], ["restaurant_id", 1], ["created_at", "2018-01-27 02:46:27.628455"], ["updated_at", "2018-01-27 02:46:27.628455"]]

  def set_resturant
    @current_restaurant ||= Restaurant.find_by(email: params[:table][:restaurant_email])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."email" = ? LIMIT ?  [["email", "sobin@gmail.com"], ["LIMIT", 1]]